Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: སེམས་ཡོངས་སུ་དག་པས་རབ་ཏུ་བརྒྱན་པ་དང་། གཟུགས་ཡོངས་སུ་དག་པས་རབ་ཏུ་བརྒྱན་པ་གང་ཡིན་པའོ།
en: Being adorned with a pure mind and ( ) being adorned with a pure appearance.

source: །གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཆོས་གཉིས་པོ་དེ་དག་ནི་ཆོས་གཅིག་གི་ནང་དུ་འཇུག་པར་འགྱུར་རོ།
en: “Candraprabhakumāra, those two qualities can further be included within a single quality.

source: །གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is this quality?

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོགས་པ་མི་མངའ་བའི་རྣམ་པར་གྲོལ་བ་མངོན་པར་གྲུབ་པ་གང་ཡིན་པའོ།
en: Accomplishing the unimpeded liberation of the thus-gone ones.

source: །གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཡང་ཆོས་རྣམ་པ་བརྒྱད་ཅུ་ཡོད་དེ། དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོགས་པ་མི་མངའ་བའི་རྣམ་པར་གྲོལ་བ་ལེགས་པར་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །རྣམ་པ་བརྒྱད་ཅུ་གང་ཞེ་ན།
en: “Furthermore, Candraprabhakumāra, there is another set of eighty qualities, through which one perfects the unimpeded liberation of the thus-gone ones. What are those eighty?

source: འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཚོགས་དང་། ཤེས་རབ་རྒྱ་ཆེན་པོར་གྱུར་པ་དང་། ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ཡོངས་སུ་སྒྲུབ་པ་དང་། ཉོན་མོངས་པའི་གདུང་བ་དང་བྲལ་བ་དང་། ང་རྒྱལ་རབ་ཏུ་བཅོམ་པ་དང་། ཚིག་མཉེན་པ་དང་། དངོས་པོ་སྣ་ཚོགས་རབ་ཏུ་ཤེས་པ་དང་། དགེ་བའི་གྲོགས་པོ་ཡོངས་སུ་ཤེས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གཞོལ་བ་དང་། བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་བགོས་པ་དང་། སྤྱོད་ལམ་གྱིས་སེམས་ཅན་འདུལ་བ་དང་། ཉོན་མོངས་པར་ལྟུང་བ་རྣམས་ཀྱི་ཐེ་ཚོམ་རབ་ཏུ་གཅོད་པ་དང་། མི་དགེ་བ་རྣམས་ལ་སྨོད་ཅིང་ཆོས་དཀར་པོ་རྣམས་མངོན་པར་བསྒྲུབ་པ་དང་། མི་དགེ་བའི་གྲོགས་པོ་དང་མི་འགྲོགས་པ་དང་། དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པ་ལ་ཡོངས་སུ་སྐྱོབ་མེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། བརྩོན་འགྲུས་རབ་ཏུ་རྩོམ་པ་དང་། བདུད་ཀྱི་དངོས་པོ་རབ་ཏུ་རྟོགས་པ་དང་། བདེན་པ་རྣམས་མངོན་དུ་གྱུར་པ་དང་། ཡང་དག་པ་ཁོ་ནར་མཆོད་པ་བྱེད་པ་དང་། ཐེ་ཚོམ་ཡོངས་སུ་གཅོད་པ་དང་། སེམས་ཀྱིས་རྟག་ཏུ་སེམས་ཅན་ཡོངས་སུ་བཟླ་བར་སེམས་པ་དང་། སྲིད་པ་རྣམས་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དང་། སེམས་རྒྱ་ཆེན་པོ་ཡོངས་སུ་བསྐྱེད་པ་དང་། སེམས་ཅན་མི་དགེ་བ་རྣམས་ལ་ཉེས་དམིགས་ཡང་དག་པར་སྟོན་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རབ་ཏུ་སྤོང་བ་དང་། འདོད་པའི་ཕན་པ་ཡོངས་སུ་མི་ཚོལ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་འཆོས་པ་དང་། འཕགས་པ་རྣམས་ལ་གུས་པ་སྐྱེད་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་གནས་པ་དག་ལ་རྟེན་ཅིང་རིམ་གྲོ་བྱེད་པ་དང་། ཐེག་པ་དམན་པ་དག་གི་བསྔགས་པ་མི་བརྗོད་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་ཐག་རིང་དུ་སྤོང་བ་དང་། ཕྱིར་རྒོལ་བ་རྣམས་ཚར་གཅོད་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བཤམས་ནས་ཁྱད་པར་དུ་འཕགས་པའི་སེམས་ཀྱིས་དབུལ་བར་བྱེད་པ་དང་། ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཐོབ་པ་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། དཔེ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པའི་ཆོས་རབ་ཏུ་སྟོན་པར་བྱེད་པ་དང་། སྟོང་པའི་ངོ་བོ་ཉིད་དང་འགལ་བར་མི་བྱེད་པ་དང་། ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་ལེ་ལོ་མེད་པ་དང་། དོན་ཟབ་མོ་ཡང་དག་པར་སྟོན་པ་དང་། གཟུངས་ཆེན་པོ་དང་ལྡན་པ་དང་། ཆོས་ཡང་དག་པར་སྟོན་པར་བྱེད་ཀྱང་མངོན་པར་ཞེན་པ་མེད་པ་དང་། ཆོས་རྒྱ་ཆེར་སྤེལ་བར་བྱེད་པ་དང་། ཡོངས་སུ་འདྲེན་པ་ལ་ཆོག་ཤེས་པ་མེད་པ་དང་། སྤྱོད་པ་རྣམས་ཡོངས་སུ་རྫོགས་པ་དང་། གཟི་བྱིན་ཆེན་པོ་དང་ལྡན་པ་དང་། སྤོབས་པ་ཐོགས་པ་མེད་པ་དང་། མང་དུ་ཐོས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། མི་དགེ་བ་རྣམས་ཀྱི་བསྔགས་པ་མི་རྗོད་པ་དང་། དགེ་བའི་ལས་ཡང་དག་པར་སྒྲུབ་པ་དང་། ཕུང་པོ་རྣམས་ཁོང་དུ་ཆུད་པ་དང་། ལྟ་བ་རྣམས་རབ་ཏུ་སྤངས་པ་དང་། རྒྱུའི་ངོ་བོ་ཉིད་རབ་ཏུ་རྟོགས་པ་དང་། སྤྱོད་ཡུལ་ལས་ཡང་དག་པར་འདས་པ་དང་། སྤྱོད་ཡུལ་མ་ཡིན་པ་ཡོངས་སུ་སྤངས་པ་དང་། ཡོངས་སུ་དང་བསྐྱེད་པ་དང་། ཡང་དག་པའི་ལམ་ལ་གནས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་དགའ་བ་དང་། མཉམ་པ་ཉིད་དུ་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་དང་། བདག་མེད་པ་ལ་མངོན་པར་མ་ཆགས་པ་དང་། འཁོར་བ་ལ་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་ཚོལ་བ་ལ་མོས་པ་དང་། འདོད་པ་ཆུང་བའི་ཕྱིར་དགོན་པ་ལ་གནས་པ་དང་། རྟག་ཏུ་བསོད་སྙོམས་སློང་ཞིང་ལེ་ལོ་མེད་པར་གྱུར་པ་དང་། ཇི་ཙམ་རྙེད་པ་དེ་ཉིད་ཀྱིས་ཆོག་པར་འཛིན་པ་དང་། ངོ་ཚ་མེད་པ་དང་། ཁྲེལ་མེད་པ་སྤངས་པ་དང་། སངས་རྒྱས་རྣམས་ལ་བསྙེན་པར་བྱེད་པ་དང་། དགེ་བའི་གྲོགས་པོ་དང་ལྷན་ཅིག་གནས་པ་དང་། བདག་གི་ཟླ་མ་ཡིན་པ་རྣམས་རབ་ཏུ་སྤོང་བ་དང་། སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་སྙིང་བརྩེ་བ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པ་དང་འཐུན་པར་བྱེད་པ་དང་། སངས་རྒྱས་ལ་ཤིན་ཏུ་དང་བ་དང་། སྣོད་མ་ཡིན་པ་ཡོངས་སུ་སྤོང་བ་དང་། མི་འཐུན་པ་རྣམས་ལ་ཚིག་སྦྱིན་པར་མི་བྱེད་པ་དང་། གསོལ་བ་མི་འདེབས་པ་དག་ལ་ཡང་དག་པར་སྟོན་པར་མི་བྱེད་པ་དང་། གསོལ་བ་འདེབས་པ་ཞིག་འོངས་ན་ཅི་རིགས་པར་སྟོན་པར་བྱེད་པ་དང་། ཟས་ལ་སྙོམས་པར་གྱུར་པ་དང་། རྟག་ཏུ་གཏོང་ཞིང་མཉམ་པ་ཉིད་དུ་གཏོང་བ་དང་། སྒོ་ཆེན་པོ་ཕྱེ་ནས་གཏོང་བར་བྱེད་པ་གང་ཡིན་པ་དེ་དག་ནི་གཞོན་ནུ་ཆོས་རྣམ་པ་བརྒྱད་ཅུ་ཅེས་བྱ་སྟེ། འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོགས་པ་མི་མངའ་བའི་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་བྱེད་དོ།
en: Being endowed with the accumulation of generosity, ( ) being endowed with vast insight, (3) accomplishing pure discipline, (4) being free from the torment of the afflictions, (5) overcoming pride, (6) speaking with soft words, (7) knowing a variety of topics, (8) knowing those who are virtuous friends, (9) dedicating oneself to the Great Vehicle, (10) donning the armor of diligence, (11) taming sentient beings through one’s behavior, (1 ) eliminating the doubts of those who have fallen into afflicted states, (13) disparaging nonvirtue and accomplishing wholesome qualities, (14) not associating with nonvirtuous friends, (15) tirelessly creating roots of virtue, (16) giving rise to the mind set on awakening, (17) engendering diligence, (18) clearly understanding the character of Māra, (19) realizing the truths, ( 0) worshiping only what is genuine, ( 1) eliminating doubts, ( ) constantly wishing to make sentient beings pass beyond suffering, ( 3) not clinging to existence, ( 4) expanding the scope of one’s mind, ( 5) teaching about shortcomings to beings who engage in nonvirtue, ( 6) completely abandoning desire, anger, and ignorance, ( 7) not pursuing sense pleasures, ( 8) ripening sentient beings, ( 9) building stūpas of thus-gone ones, (30) developing one’s reverence toward noble beings, (31) associating with and serving those who are grounded in the Great Vehicle, (3 ) not praising those who follow the Lower Vehicle, (33) staying far away from those who follow the vehicle of the hearers, (34) overcoming opponents, (35) preparing vast offerings and offering them to the blessed buddhas with a noble attitude, (36) achieving unimpeded wisdom, (37) being endowed with perfect eloquence, (38) teaching the authentic Dharma through a variety of analogies, (39) not contradicting the empty essence, (40) not succumbing to laziness while pursuing the Dharma, (41) teaching the profound meaning, (4 ) possessing the great power of retention, (43) teaching the Dharma but not clinging to it, (44) propagating the Dharma on a vast scale, (45) insatiably guiding beings, (46) perfecting one’s modes of conduct, (47) being endowed with great majesty, (48) being endowed with unimpeded eloquence, (49) being endowed with excellent erudition, (50) not proclaiming the praises of nonvirtuous people, (51) accomplishing virtuous actions, (5 ) comprehending the aggregates, (53) completely giving up views, (54) realizing the essential nature of causes, (55) transcending the domain of experience, (56) giving up improper domains, (57) developing intense faith, (58) dwelling on the genuine path, (59) delighting in the Great Vehicle, (60) attracting beings impartially, (61) not being attached to selflessness, (6 ) not becoming weary about saṃsāra, (63) being dedicated to seeking nirvāṇa, (64) staying in the wilderness because of having few desires, (65) never succumbing to laziness while collecting alms, (66) being content with whatever one gets, (67) giving up shamelessness and indecency, (68) serving the buddhas, (69) staying in the presence of virtuous friends, (70) staying away from those who are not of the same ilk, (71) being sympathetic toward ordinary beings, (7 ) acting in conformity with sentient beings’ way of behaving, (73) having great faith in the buddhas, (74) abandoning those who are improper vessels, (75) not giving teachings to inappropriate beings, (76) not teaching those who do not ask for it, (77) teaching in a variety of ways to those who ask for it, (78) being disinterested with respect to food, (79) giving continuously and impartially, and (80) giving without holding anything back — Kumāra, those are the eighty qualities through which one achieves the unimpeded liberation of the thus-gone ones.”

source: །དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཆོས་དེ་ལྟ་བུ་ཐོས་པས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་པ།
en: When he heard that teaching, Candraprabhakumārabhūta became overjoyed and spoke these verses of praise in the presence of the Blessed One:

source: དེ་བཞིན་གཤེགས་པ་མིག་ཟད་མཐའ་མཁྱེན་པས། །དེ་སླད་རྣམ་དག་ཡེ་ཤེས་སྟོན་མཛད་ལགས།
en: “Since the Thus-Gone One knows The limit of the exhaustion of the eye,

source: །རྣམ་དག་ཡེ་ཤེས་སྟོན་པར་མཛད་པས་ན།
en: He displays pure wisdom

source: །རྣམ་དག་འོད་ཟེར་ཕུན་སུམ་ཚོགས་པ་ལགས།
en: And is therefore endowed with pure and perfect lights.

source: །དེ་བཞིན་གཤེགས་པས་མིག་བདག་མེད་མཁྱེན་པས། །དེ་སླད་རྣམ་དག་དབྱངས་ནི་སྟོན་མཛད་ལགས།
en: “Since the Thus-Gone One knows The selflessness of the eye,

source: །རྣམ་དག་དབྱངས་ནི་སྟོན་པར་མཛད་པས་ན།
en: He speaks with a pure voice

source: །ཚངས་དབྱངས་མཚན་ཉིད་ཕུན་སུམ་ཚོགས་པ་ལགས།
en: And is therefore endowed with the perfect voice of Brahmā. “Since the Blessed One

source: །བཅོམ་ལྡན་སྔོན་ནི་སེམས་ཅན་ཕན་བཏགས་པས། །དེ་སླད་རྣམ་དག་གསུང་ནི་རྫོགས་པ་ལགས།
en: Has benefited sentient beings in the past,

source: །རྣམ་དག་གསུང་ནི་ཡོངས་སུ་རྫོགས་པས་ན།
en: He has perfected pure speech,

source: །འཇིག་རྟེན་ཚད་མེད་རྣམས་ལ་ཕན་འདོགས་མཛད།
en: And he therefore benefits an infinity of worlds.

source: །དེ་བཞིན་གཤེགས་པས་མིག་ཉིད་སྟོང་མཁྱེན་པས། །དེ་སླད་ཀུན་འཛིན་མཁྱེན་པ་རྫོགས་པ་ལགས།
en: “Since the Thus-Gone One knows The emptiness of the eye,

source: །ཀུན་འཛིན་མཁྱེན་པ་ཡོངས་སུ་རྫོགས་པས་ན།
en: He has perfected all-comprehending wisdom,

source: །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་དཔག་མེད་སྟོན།
en: And therefore displays the Thus-Gone One’s infinite lights.

source: །དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁྱད་པར་མཁྱེན།
en: “The Buddha knows the characteristics of the eye,

source: །མིག་གི་ཁྱད་པར་དག་ཀྱང་མཐའ་མ་མཆིས།
en: And those particularities are endless;

source: །མཁྱེན་པའི་མིང་ནི་དཔག་ཏུ་མ་མཆིས་པས།
en: Thus, since the names of wisdom are infinite,

source: །སངས་རྒྱས་ཡི་གེ་ཁྱད་པར་སྒོ་མཁྱེན་པས།
en: “Since the Buddha knows The gateways of the particular words,

source: །མིག་སྟོང་ཡི་གེ་བྲལ་བར་རབ་ཏུ་མཁྱེན། །མིག་སྟོང་ཡི་གེ་བྲལ་བར་མཁྱེན་པས་ན།
en: He realizes that the eye is empty and beyond words,

source: །གང་ཞིག་མིག་ལ་བདག་མེད་རབ་སེམས་པ།
en: “Those who contemplate the selflessness of the eye

source: །སངས་རྒྱས་གསུང་ནི་བདེན་པ་ཉིད་དུ་རྟོགས། །སངས་རྒྱས་གསུང་ནི་བདེན་པར་རྟོགས་པས་ན།
en: Will realize that the Buddha speaks the truth,

source: །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་ངེས་པ་སྟོན།
en: And they will therefore display the certainty Of the Thus-Gone One’s lights. “Since the Blessed One

source: །བཅོམ་ལྡན་རྫུ་འཕྲུལ་མཆོག་ནི་ཡོངས་རྫོགས་པས།
en: Has perfected the most sublime miraculous powers,

source: །མིག་གི་འཇིག་པ་དཔག་མེད་ཐུགས་སུ་ཆུད། །མིག་གི་འཇིག་པ་རབ་ཏུ་མཁྱེན་པས་ན།
en: He understands the boundless disintegration of the eye,

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་འདོགས་མཛད།
en: And he therefore benefits all the worlds.

source: །ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ།
en: “The great compassionate one, foremost among human beings,

source: །མིག་གི་སྐྱེ་བ་དཔག་མེད་རབ་ཏུ་མཁྱེན།
en: Knows the boundless arising of the eye; May I too, before long,

source: །ཇི་ལྟར་བཅོམ་ལྡན་མིག་གི་སྐྱེ་མཁྱེན་པ།
en: Know the arising of the eye as the Blessed One does! “In the same way, his knowledge encompasses

source: །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་ཤོག །དེ་བཞིན་རྣ་བ་སྣ་དང་ལྕེ་ལུས་ཡིད།
en: The ear, the nose, the tongue, the body, the mind,

source: །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་དག་དང་ཆོས།
en: Forms, sounds, scents, textures, mental phenomena,

source: །འཇིག་རྟེན་སྐྱེ་དང་སྒྲ་དང་མིང་ལ་སོགས། །ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་རབ་ཏུ་མཁྱེན།
en: Worldly arising, words, names, and so forth.

source: །སྦྱིན་པའི་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་སྦྱིན་པའི་ཕ་རོལ་བྱོན།
en: Is endowed with the excellent perfection of generosity;

source: །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་ཤོག །ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ།
en: May I too, before long, in the same way as the Blessed One, Be endowed with the perfection of generosity! “The great compassionate one, foremost among human beings,

source: །ཚུལ་ཁྲིམས་རྣམ་དག་ཕ་རོལ་བྱོན་དང་ལྡན།
en: Is endowed with the excellent perfection of discipline; May I too, before long, in the same way as the Blessed One,

source: །ཇི་ལྟར་བཅོམ་ལྡན་ཚུལ་ཁྲིམས་ཕ་རོལ་བྱོན།
en: Be endowed with the perfection of discipline! “The great compassionate one, foremost among human beings, Is endowed with the excellent perfection of patience;

source: །བཟོད་པའི་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས།
en: Be endowed with the perfection of patience!

source: །ཇི་ལྟར་བཅོམ་ལྡན་བཟོད་པའི་ཕ་རོལ་བྱོན།
en: “The great compassionate one, foremost among human beings, Is endowed with the excellent perfection of diligence;

source: །བརྩོན་འགྲུས་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས།
en: Be endowed with the perfection of diligence! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་བརྩོན་འགྲུས་ཕ་རོལ་བྱོན།
en: Is endowed with the excellent perfection of concentration;

source: །བསམ་གཏན་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས།
en: Be endowed with the perfection of concentration! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་བསམ་གཏན་ཕ་རོལ་བྱོན།
en: Is endowed with the excellent perfection of insight;

source: །ཤེས་རབ་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་ཤེས་རབ་ཕ་རོལ་བྱོན།
en: Be endowed with the perfection of insight! “The great compassionate one, foremost among human beings, Has attained the excellent and perfect Dharma body;

source: །ཆོས་སྐུའི་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས།
en: Attain the perfect Dharma body!

source: །ཇི་ལྟར་བཅོམ་ལྡན་ཆོས་སྐུའི་ཕ་རོལ་བྱོན།
en: “The great compassionate one, foremost among human beings, Is endowed with excellent, pure, and infinite forms;

source: །རྣམ་དག་གཟུགས་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས།
en: Be endowed with pure forms!

source: །ཇི་ལྟར་བཅོམ་ལྡན་རྣམ་དག་གཟུགས་ལྡན་པ།
en: “The great compassionate one, foremost among human beings, Is endowed with an excellent, pure, and limitless mind;

source: །རྣམ་དག་ཡིད་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས།
en: Be endowed with a pure mind!

source: །ཇི་ལྟར་བཅོམ་ལྡན་རྣམ་དག་ཡིད་ལྡན་པ།
en: “The great compassionate one, foremost among human beings, Is endowed with the most excellent and infinite qualities;

source: །ཡོན་ཏན་མཆོག་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས།
en: Be endowed with supreme qualities!

source: །ཇི་ལྟར་བཅོམ་ལྡན་ཡོན་ཏན་མཆོག་ལྡན་པ།
en: “The great compassionate one, foremost among human beings, Is endowed with the excellent and boundless physical marks;

source: །གཟུགས་ཀྱི་མཚན་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས།
en: Be endowed with the physical marks!

source: །ཇི་ལྟར་བཅོམ་ལྡན་གཟུགས་ཀྱི་མཚན་ལྡན་པ།
en: “The great compassionate one, foremost among human beings, Is endowed with pure and infinite voices;

source: །རྣམ་དག་སྒྲ་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་རྣམ་དག་སྒྲ་ལྡན་པ།
en: Be endowed with pure voices!

source: །རྫུ་འཕྲུལ་ཆེན་པོ་དཔག་མེད་ཕུན་སུམ་ཚོགས།
en: Has reached excellent and boundless great miraculous power; May I too, before long, in the same way as the Blessed One,

source: །ཇི་ལྟར་བཅོམ་ལྡན་རྫུ་འཕྲུལ་ཆེར་ལྡན་པ།
en: Be endowed with great miraculous power!

source: །སེམས་ཅན་གདུལ་སླད་སྲིད་པ་གསུམ་ན་བཞུགས།
en: Remains in the three realms to guide sentient beings; May I too, before long, in the same way as the Blessed One,

source: །ཇི་ལྟར་བཅོམ་ལྡན་སེམས་ཅན་གདུལ་མཛད་པ།
en: Guide sentient beings! “The great compassionate one, foremost among human beings, Has transcended the infinite activities of saṃsāra;

source: །འཁོར་བའི་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས།
en: Transcend the activities of saṃsāra! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་འཁོར་བའི་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of desire;

source: །འདོད་ཆགས་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས།
en: Transcend the modes of desire! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་འདོད་ཆགས་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of anger;

source: །ཞེ་སྡང་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས།
en: Transcend the modes of anger! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་ཞེ་སྡང་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of ignorance;

source: །གཏི་མུག་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས།
en: Transcend the modes of ignorance! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་གཏི་མུག་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of desire and anger;

source: །འདོད་ཆགས་ཞེ་སྡང་སྤྱོད་པ་དཔག་མེད་འདས།
en: Transcend the modes of desire and anger! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་འདོད་སྡང་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of anger and ignorance;

source: །ཞེ་སྡང་གཏི་མུག་སྤྱོད་པ་དཔག་མེད་འདས།
en: Transcend the modes of anger and delusion! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་སྡང་རྨོངས་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of desire and ignorance;

source: །འདོད་ཆགས་གཏི་མུག་སྤྱོད་པ་དཔག་མེད་འདས།
en: Transcend the modes of desire and delusion! “The great compassionate one, foremost among human beings,

source: །ཇི་ལྟར་བཅོམ་ལྡན་འདོད་རྨོངས་སྤྱོད་འདས་པ།
en: Has transcended the infinite modes of the joint afflictions;

source: །ཆ་མཉམ་སྤྱོད་པ་དཔག་མེད་ཡང་དག་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་ཆ་མཉམ་སྤྱོད་འདས་པ།
en: Transcend the modes of the joint afflictions!

source: །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་ཤོག །འདྲེན་པ་འདོད་ཆགས་དག་ལས་ཡོངས་འདས་པས།
en: “Since he has transcended desire,

source: །འཇིག་རྟེན་ཀུན་ལ་ཤིན་ཏུ་ཕན་འདོགས་མཛད།
en: The Guide benefits the entire world; May I, too, achieve that wisdom,

source: །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ།
en: To benefit the world just as the Blessed One does!

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །འདྲེན་པ་ཞེ་སྡང་དག་ལས་ཡོངས་འདས་པས།
en: “Since he has transcended anger,

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །འདྲེན་པ་གཏི་མུག་སྤྱོད་ལས་ཡོངས་འདས་པས།
en: “Since he has transcended ignorance,

source: །འཇིག་རྟེན་ཀུན་ལ་ཤིན་དུ་ཕན་འདོགས་མཛད།
en: The Guide benefits all the world; May I, too, achieve that wisdom,

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །འདྲེན་པ་འདོད་ཆགས་ཞེ་སྡང་སྤྱོད་འདས་པས།
en: “Since he has transcended desire and anger,

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །འདྲེན་པ་ཞེ་སྡང་གཏི་མུག་སྤྱོད་འདས་པས།
en: “Since he has transcended anger and ignorance,

source: །འཇིག་རྟེན་ཀུན་ལས་ཤིན་ཏུ་ཕན་འདོགས་མཛད།
en: The Guide benefits all the world; May I, too, achieve that wisdom,

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །འདྲེན་པ་འདོད་ཆགས་གཏི་མུག་སྤྱོད་འདས་པས།
en: “Since he has transcended desire and ignorance,

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །འདྲེན་པ་ཆགས་སྡང་གཏི་མུག་སྤྱོད་འདས་པས།
en: “Since he has transcended desire, anger, and ignorance,

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་ཤོག །དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་པས།
en: “Since he is endowed with supreme wisdom,

source: །ལྷ་ཚོགས་མང་པོ་ཐམས་ཅད་འདུལ་བར་མཛད།
en: The Thus-Gone One guides all the many gods;

source: །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས།
en: May I, too, achieve that wisdom

source: །ལྷ་མི་ཁ་ལོ་སྒྱུར་བའི་སྟོན་པར་ཤོག །དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་པས།
en: And become a teacher to lead both gods and humans! “Since he is endowed with supreme wisdom,

source: །ཀླུ་ཚོགས་མང་པོ་ཐམས་ཅད་འདུལ་བར་མཛད།
en: The Thus-Gone One guides all the many groups of nāgas;

source: །གནོད་སྦྱིན་མང་པོ་ཐམས་ཅད་འདུལ་བར་མཛད།
en: The Thus-Gone One guides all the numerous yakṣas;

source: །དྲི་ཟ་ཐམས་ཅད་རབ་ཏུ་འདུལ་མཛད་ཅིང་། །དེ་བཞིན་གྲུལ་བུམ་དཔག་ཏུ་མ་མཆིས་པ།
en: The Thus-Gone One guides all gandharvas and the countless kumbhāṇḍas

source: །འཁོར་བཅས་ཇི་སྙེད་རབ་ཏུ་འདུལ་བར་མཛད།
en: Along with their retinues;

source: །ཆོས་རྣམས་ཡང་དག་དོན་ནི་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the true nature of phenomena;

source: །ཡང་དག་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པ་སྡུག་བསྔལ་ཟད་མཐའ་མཁྱེན།
en: And be free from doubts about that truth! “Since he knows the limit of the exhaustion of suffering,

source: །སྐྱེ་དགུ་ཐམས་ཅད་ལ་ནི་ཕན་འདོགས་མཛད།
en: The Thus-Gone One benefits all beings;

source: །སྡུག་བསྔལ་ཟད་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པས་རྒྱུ་ཟད་མཐའ་མཁྱེན་པས།
en: And be free from doubts about the exhaustion of suffering! “Since he knows the limit of the exhaustion of causes,

source: །རྒྱུ་ཟད་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་པས།
en: And be free from doubts about the exhaustion of causes! “Since he is endowed with supreme wisdom,

source: །འཇིག་རྟེན་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the activities of the world;

source: །འཇིག་རྟེན་སྤྱོད་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་པས།
en: And be free from doubts about the activities of the world! “Since he is endowed with supreme wisdom,

source: །འཇིག་རྟེན་གནས་དང་གནས་མེད་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows what is possible and impossible in the world;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་པས།
en: And benefit all the world! “Since he is endowed with supreme wisdom,

source: །འཇིག་རྟེན་ལས་དང་འབྲས་བུ་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the karmic actions and effects of the world;

source: །འཇིག་རྟེན་རང་བཞིན་སྣ་ཚོགས་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the various natures of the world;

source: །ཐམས་ཅད་ཀུན་དུ་འགྲོ་བའི་སྤྱོད་པ་མཁྱེན།
en: The Thus-Gone One knows the actions that lead to all destinations;

source: །འཇིག་རྟེན་མོས་པ་སྣ་ཚོགས་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the various inclinations of worldly beings;

source: །དབང་པོ་རྣམས་ཀྱི་རང་བཞིན་ཐམས་ཅད་མཁྱེན།
en: The Thus-Gone One knows all the modes of the faculties;

source: །བསམ་གཏན་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the practices of concentration;

source: །རྣམ་པར་ཐར་པའི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the practices of liberation;

source: །ཆ་མཉམ་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the practices of equipoise;

source: །སྙོམས་འཇུག་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the practices of attainment;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པ་འཁོར་བ་རབ་མཁྱེན་པས།
en: And benefit all the world! “Since he clearly understands saṃsāra,

source: །འཁོར་བ་ཉོན་མོངས་རྒྱུ་ལས་སྐྱེས་པར་མཁྱེན།
en: The Thus-Gone One knows that saṃsāra arises from the cause of the afflictions;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་རབ་མཁྱེན་པས།
en: And benefit all the world! “Since he clearly knows everything,

source: །འཇིག་རྟེན་ཕན་འདོགས་དཔེ་ཟླ་ཡོང་མ་མཆིས།
en: The Thus-Gone One is peerless when it comes to benefitting the world;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་ཏིང་འཛིན་རབ་གནས་པས།
en: And benefit all the world! “Since he dwells within states of absorption,

source: །ཁྱད་པར་ཐབས་ཀྱི་ཡེ་ཤེས་སྐྱེད་པར་མཛད།
en: The Thus-Gone One manifests the wisdom of unique methods;

source: །སྔོན་གྱི་གནས་ཀྱི་སྤྱོད་པ་དཔག་མེད་མཁྱེན།
en: The Thus-Gone One knows the infinite deeds of previous lives;

source: །འཆི་འཕོ་སྐྱེ་བ་དཔག་མེད་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the countless deaths and rebirths;

source: །ཉོན་མོངས་ཟད་པ་ཐམས་ཅད་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows all the exhaustions of the afflictions;

source: །བླ་མེད་བྱང་ཆུབ་ཡང་དག་མངོན་སངས་རྒྱས།
en: The Thus-Gone One has awakened to unsurpassed and perfect buddhahood;

source: །ཉོན་མོངས་བག་ཆགས་དག་ནི་རབ་ཏུ་སྤངས།
en: The Thus-Gone One has completely abandoned all afflictions and their habitual patterns;

source: །འཁོར་བ་ངེས་འབྱུང་ཆོས་ནི་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One clearly knows the qualities of escaping saṃsāra;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་ཆོས་དོན་རབ་མཁྱེན་པས།
en: And benefit all the world! “Since he clearly knows the meaning of the Dharma,

source: །སེམས་ཅན་དཔག་མེད་རྣམས་ནི་གོ་བར་མཛད།
en: The Thus-Gone One makes countless beings understand;
